
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура apiUrlПриИзменении(Элемент)
	
	Если СтрЗаканчиваетсяНа(Объект.apiUrl, "/") Тогда
		Объект.apiUrl = Лев(Объект.apiUrl, СтрДлина(Объект.apiUrl) - 1);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Авторизация(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАвторзиации = Новый Структура("idInstance, apiTokenInstance, apiUrl", Объект.idInstance, Объект.apiTokenInstance, Объект.apiUrl);
	ОткрытьФорму("ВнешняяОбработка.ЧатWhatsApp.Форма.ФормаЧата", ПараметрыАвторзиации);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
